---
kind: other
id: Properties.T:Autodesk.Revit.DB.Architecture.PostPattern
source: html/403f65ec-c5e1-bce3-63c9-3b17216c7431.htm
---
# PostPattern Properties

Accesses the object containing properties related to the corner post.